software/caTissue/modules/caTissueStaticDataService/test/SOAP-XMLs/InsertCollectionProtocolRegistration.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <InsertRequest xmlns="http://wapi.wustl.edu/WAPI">
            <object>
                <ns1:AbstractDomainObject activityStatus="Active" id="0"
                                          xsi:type="ns2:CollectionProtocolRegistration"
                                          xmlns:ns1="gme://caCORE.caCORE/3.2/edu.wustl.common.domain.ws"
                                          xmlns:ns2="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.ws">
                    <ns2:collectionProtocol>
                        <ns2:CollectionProtocol aliquotInSameContainer="false" consentsWaived="false"
                                                dirtyEditFlag="false" id="483" remoteId="0" remoteManagedFlag="false"
                                                studyCalendarEventPoint="0.0" />
                    </ns2:collectionProtocol>
                    <ns2:participant>
                        <ns2:Participant id="2"/>
                    </ns2:participant>
                </ns1:AbstractDomainObject>
            </object>
        </InsertRequest>
    </soapenv:Body>
</soapenv:Envelope>